{
  "add_bias_sampling": false,
  "add_residual_after": false,
  "architectures": [
    "T5ForConditionalGeneration"
  ],
  "d_ff": 3072,
  "d_kv": 64,
  "d_model": 768,
  "decoder_side_layers": null,
  "decoder_start_token_id": 0,
  "dropout_rate": 0.1,
  "encoder_side_layers": null,
  "eos_token_id": 1,
  "feed_forward_proj": "relu",
  "gate_T": 0.1,
  "gate_alpha": 0,
  "gradient_checkpointing": false,
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "lambda_distill": 0,
  "lambda_kd_ir": 1,
  "lambda_label": 1,
  "layer_norm_epsilon": 1e-06,
  "merge_last": false,
  "model_type": "t5",
  "n_positions": 512,
  "num_decoder_layers": 12,
  "num_heads": 12,
  "num_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "prefix_tuning": false,
  "relative_attention_num_buckets": 32,
  "side_downsample_pool": false,
  "task_specific_params": {
    "summarization": {
      "early_stopping": true,
      "length_penalty": 2.0,
      "max_length": 200,
      "min_length": 30,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "summarize: "
    },
    "translation_en_to_de": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to German: "
    },
    "translation_en_to_fr": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to French: "
    },
    "translation_en_to_ro": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to Romanian: "
    }
  },
  "train_side_ladder": false,
  "train_task_adapters": false,
  "transformers_version": "4.6.0",
  "use_cache": true,
  "use_gate": "none",
  "vocab_size": 32128
}
